# ðŸ“š SQL HAVING
___

<div style="font-family: Avenir, sans-serif; font-size: 16px; line-height: 1.6; color: white; background-color: #333; padding: 10px; border-radius: 5px;">
This series of notebooks is a collection of my SQL projects. I have been working with SQL for a few years now and I have been using it in various projects. I have decided to create this portfolio to showcase my SQL skills. I hope you enjoy it!

</div>

Welcome to my SQL portfolio! This notebook delves into HAVING combine with GROUP BY, demonstrating my understanding of key SQL concepts, including:

- Using **aliases** for enhanced readability and clarity
- Performing **Right Joins** to combine data from multiple tables with specified conditions
- Leveraging **aggregations** to summarize data insights
- Filtering aggregated results with **HAVING clauses** for precise queries

To showcase the practical applications of SQL in data analysis and database management, Iâ€™ve integrated Python to connect to the database, execute SQL queries, and display results directly within this notebook.

### Database Overview

This notebook utilizes the `classicmodels` sample database, which includes key tables like **customers**, **orders**, **products**, and **orderdetails**. These tables represent real-world relationships among customers, products, and sales orders, providing a realistic foundation for practicing SQL join operations.

### Key Tables and Columns:

- **customers**: `customerNumber`, `customerName`, `contactLastName`, `contactFirstName`
- **orders**: `orderNumber`, `orderDate`, `customerNumber`
- **orderdetails**: `orderNumber`, `productCode`, `quantityOrdered`, `priceEach`
- **products**: `productCode`, `productName`, `productLine`, `msrp`

By combining SQL techniques with Python's database connectivity, this portfolio demonstrates efficient ways to perform business data analysis and streamline insights into customer orders, products, and sales.

In [7]:
# Import necessary libraries
import mysql.connector
import pandas as pd

# Establish database connection
connection = mysql.connector.connect(
    user='root',
    password='Password1234',
    host='localhost',
    database='classicmodels'
)

# Function to execute SQL queries and display results
def execute_query(query):
    cursor = connection.cursor()
    cursor.execute(query)
    
    # Fetch results and convert to a DataFrame
    result = cursor.fetchall()
    columns = [desc[0] for desc in cursor.description]  # Column names
    
    # Close cursor after execution
    cursor.close()
    return pd.DataFrame(result, columns=columns)

____

### HAVING with GROUP BY syntax

In [ ]:
SELECT 
  column1, 
  column2, 
  column3, 
  aggregate_function(column4)
FROM 
  table_name 
WHERE 
  condition_statement
GROUP BY
 column1, column2, column3
HAVING
  group_conditions;

___

### Question 1  

**Objective:** Use the `GROUP BY` clause to summarize sales data and apply the `HAVING` clause to filter results.

**Task**  

Using the `orderdetails` table, write a query to:  

- Retrieve the order numbers.  
- Calculate the total number of items sold per order.  
- Calculate the total sales for each order.  

**Requirements**  

- Use the `SUM` function to calculate total items sold and total sales amount per order.  
- Use the `GROUP BY` clause to group results by `orderNumber`.  

**Solution**  

```sql
SELECT
    ordernumber,
    SUM(quantityOrdered) AS items_Count,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
GROUP BY
    orderNumber;
```

In [2]:
sql_query = """

SELECT
    ordernumber,
    SUM(quantityOrdered) AS items_Count,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
GROUP BY
    orderNumber;

"""

# Execute the query and display the results
result_df = execute_query(sql_query)
result_df

     ordernumber items_Count Total_Amount
0          10100         151     10223.83
1          10101         142     10549.01
2          10102          80      5494.78
3          10103         541     50218.95
4          10104         443     40206.20
..           ...         ...          ...
321        10421          75      7639.10
322        10422          76      5849.44
323        10423         111      8597.73
324        10424         269     29310.30
325        10425         427     41623.44

[326 rows x 3 columns]

___

### Question 2  

**Objective:** Filter grouped results using the `HAVING` clause to find high-value orders.

**Task**  

Using the `orderdetails` table, write a query to:  

- Retrieve order numbers where total sales exceed `1000`.  
- Calculate the total sales for each order.  

**Requirements**  

- Use the `SUM` function to calculate total sales per order.  
- Use the `GROUP BY` clause to group results by `orderNumber`.  
- Use the `HAVING` clause to filter orders with total sales greater than `1000`.  

**Solution**  

```sql
SELECT
    ordernumber,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
GROUP BY
    orderNumber
HAVING
    Total_Amount > 1000;

```

In [3]:
sql_query = """

SELECT
    ordernumber,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
GROUP BY
    orderNumber
HAVING
    Total_Amount > 1000;
"""

# Execute the query and display the results
result_df = execute_query(sql_query)
result_df

     ordernumber Total_Amount
0          10100     10223.83
1          10101     10549.01
2          10102      5494.78
3          10103     50218.95
4          10104     40206.20
..           ...          ...
320        10421      7639.10
321        10422      5849.44
322        10423      8597.73
323        10424     29310.30
324        10425     41623.44

[325 rows x 2 columns]

___

### Question 3  

**Objective:** Use logical operators in the `HAVING` clause to filter grouped results with multiple conditions.

**Task**  

Using the `orderdetails` table, write a query to:  

- Retrieve order numbers where total sales exceed `1000`.  
- Identify orders that contain more than `600` items.  

**Requirements**  

- Use the `SUM` function to calculate total sales and total items per order.  
- Use the `GROUP BY` clause to group results by `orderNumber`.  
- Use the `HAVING` clause with `AND` to filter orders with total sales greater than `1000` and more than `600` items.  

**Solution**  

```sql
SELECT
    ordernumber,
    SUM(quantityOrdered) AS itemsCount,
    SUM(priceeach * quantityOrdered) AS total
FROM
    orderdetails
GROUP BY
    ordernumber
HAVING
    total > 1000
    AND
    itemsCount > 600;
```

In [4]:
sql_query = """

SELECT
    ordernumber,
    SUM(quantityOrdered) AS itemsCount,
    SUM(priceeach * quantityOrdered) AS total
FROM
    orderdetails
GROUP BY
    ordernumber
HAVING
    total > 1000
    AND
    itemsCount > 600;
```

"""

# Execute the query and display the results
result_df = execute_query(sql_query)
result_df

    ordernumber itemsCount     total
0         10106        675  52151.81
1         10126        617  57131.92
2         10135        607  55601.84
3         10165        670  67392.85
4         10168        642  50743.65
5         10204        619  58793.53
6         10207        615  59265.14
7         10212        612  59830.55
8         10222        717  56822.65
9         10262        605  47065.36
10        10275        601  47924.19
11        10310        619  61234.67
12        10312        601  55639.66
13        10316        623  46788.14
14        10332        621  47159.11
15        10339        614  48927.64
16        10360        620  52166.00
17        10373        605  46770.52
18        10386        650  46968.52
19        10390        603  55902.50
20        10398        629  46656.94
21        10414        609  50806.85

___

### Question 4  

**Objective:** Use `HAVING` with `INNER JOIN` to filter orders based on multiple tables.

**Task**  

Using the `orderdetails` and `orders` tables, write a query to:  

- Retrieve order numbers where the order status is `Shipped`.  
- Identify orders with a total amount greater than `1500`.  

**Requirements**  

- Use `INNER JOIN` to join the `orderdetails` table with the `orders` table using `orderNumber`.  
- Use the `SUM` function to calculate total sales per order.  
- Use `GROUP BY` to group results by `orderNumber` and `status`.  
- Use the `HAVING` clause with `AND` to filter orders where `status = 'Shipped'` and total sales exceed `1500`.  

**Solution**  

```sql
SELECT
    orderdetails.orderNumber,
    orders.status,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
INNER JOIN
    orders
USING(orderNumber)
GROUP BY
    orderdetails.orderNumber,
    orders.status
HAVING
    status = 'Shipped'
    AND
    Total_Amount > 1500;
```

In [8]:
sql_query = """

SELECT
    orderdetails.orderNumber,
    orders.status,
    SUM(quantityOrdered * priceEach) AS Total_Amount
FROM
    orderdetails
INNER JOIN
    orders
USING(orderNumber)
GROUP BY
    orderdetails.orderNumber,
    orders.status
HAVING
    status = 'Shipped'
    AND
    Total_Amount > 1500;

"""

# Execute the query and display the results
result_df = execute_query(sql_query)
result_df

     orderNumber   status Total_Amount
0          10100  Shipped     10223.83
1          10101  Shipped     10549.01
2          10102  Shipped      5494.78
3          10103  Shipped     50218.95
4          10104  Shipped     40206.20
..           ...      ...          ...
295        10412  Shipped     46895.48
296        10413  Shipped     28500.78
297        10416  Shipped     35362.26
298        10418  Shipped     23627.44
299        10419  Shipped     52420.07

[300 rows x 3 columns]

----

### Summary and Personal Reflection
____


This chapter explored the power of the `HAVING` clause in SQL, highlighting its ability to filter grouped data and refine query results efficiently. By combining `GROUP BY` with aggregate functions and logical operators, we can uncover meaningful insights, such as identifying high-value orders and analyzing sales performance based on multiple conditions.

Through this learning process, I have reinforced my understanding of how `HAVING` differs from `WHERE`, particularly when working with aggregated data. Applying multiple conditions using `AND` and `OR` has further enhanced my ability to structure complex queries that yield precise results.

Mastering these concepts is crucial for any SQL practitioner, as they play a significant role in real-world data analysis and business intelligence. I encourage further practice with different datasets to gain deeper insights into grouping and filtering data effectively.

I hope you found this chapter insightful. Feel free to explore additional SQL techniques and challenges to continue refining your skills. Thank you for reading!